app/views/bnbs/show.html.erb

          <div class="thumbnail">
            <% if @bnb.photos.processed.main_photo.empty? %>
---
SELECT COUNT(*) FROM "photos" WHERE "photos"."bnb_id" = 59