app/views/rooms/destroy.js.erb

$('#flash').html('<%= escape_javascript(render :partial => 'shared/flash_messages')%>');
<% if @room.destroyed? %>
---
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 61]]