app/controllers/bnb_steps_controller.rb

INSERT INTO "rooms" ("bnb_id", "created_at", "description", "en_suite", "extras", "rates", "room_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def update
    @bnb.status = last_step(step) ? 'active' : step.to_s
    @bnb.region = Search.new(params[:search]).region if params[:search]
    build_default_rooms if @bnb.rooms.empty?
    @bnb.save