app/controllers/bnb_steps_controller.rb

  def show
    @bnb = Bnb.find(params[:bnb_id])
---
SELECT "bnbs".* FROM "bnbs" WHERE "bnbs"."id" = ? LIMIT 1  [["id", "8"]]

  def update
    @bnb = Bnb.find(params[:bnb_id])
    build_rooms(params[:bnb][:number_of_rooms].to_i) if params[:bnb][:number_of_rooms]
    params[:bnb][:status] = step.to_s
    params[:bnb][:status] = 'active' if step == steps.last
    @bnb.update_attributes(params[:bnb])
---
SELECT "bnbs".* FROM "bnbs" WHERE "bnbs"."id" = ? LIMIT 1  [["id", "8"]]
UPDATE "bnbs" SET "email" = 'asdsa', "address_line_one" = 'sadd', "address_line_two" = 'sasad', "city" = 'asdds', "postal_code" = 'sdada', "country" = 'South Africa', "telephone_number" = 'asddsa', "website" = 'dsaads', "updated_at" = '2012-07-25 17:56:46.524243' WHERE "bnbs"."id" = 13