app/controllers/bnbs_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."bnb_id" = 1
---
  def show
    @bnb = Bnb.includes(:photos).find_by_user_id(current_user) if @bnb.nil?