app/controllers/bnbs_controller.rb

SELECT "bnbs".* FROM "bnbs" ORDER BY "bnbs"."id" DESC LIMIT 1
---
  def index
    @bnbs = Bnb.all

INSERT INTO "bnbs" ("address_line_one", "address_line_two", "city", "contact_person", "country", "created_at", "description", "email", "facebook_page", "name", "postal_code", "telephone_number", "twitter_account", "updated_at", "user_id", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @bnb = Bnb.new(params[:bnb])

      if @bnb.save

UPDATE "bnbs" SET "email" = 'sda', "address_line_one" = 'sda', "address_line_two" = 'sda', "city" = 'sdadsa', "postal_code" = 'dsaasd', "telephone_number" = 'dsaas', "website" = 'sadsa', "updated_at" = '2012-07-25 16:58:57.429908' WHERE "bnbs"."id" = 8
---
  def update
    @bnb = Bnb.find(params[:id])

    respond_to do |format|
      if @bnb.update_attributes(params[:bnb])