app/controllers/bnbs_controller.rb

SELECT "bnbs".* FROM "bnbs" WHERE "bnbs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @bnb = Bnb.find(params[:id])

SELECT "bnbs".* FROM "bnbs" WHERE "bnbs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @bnb = Bnb.find(params[:id])

SELECT "bnbs".* FROM "bnbs" WHERE "bnbs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @bnb = Bnb.find(params[:id])

SELECT "bnbs".* FROM "bnbs" WHERE "bnbs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def destroy
    @bnb = Bnb.find(params[:id])