app/controllers/bookings_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 45]]
INSERT INTO "bookings" ("active", "created_at", "guest_id", "updated_at") VALUES (?, ?, ?, ?)  [["active", true], ["created_at", Tue, 07 Aug 2012 09:40:15 UTC +00:00], ["guest_id", 1], ["updated_at", Tue, 07 Aug 2012 09:40:15 UTC +00:00]]
---
  def create
    @booking = @bnb.bookings.build(params[:booking]) do |booking|
      booking.user_id = current_user.id
      booking.try(:guest).user_id = current_user.id if booking.guest.try(:new_record?)
      booking.rooms = Room.find(params[:room_ids]) if params[:room_ids]
      booking.status = :booked unless booking.online?
    end

    @booking.save