app/controllers/bookings_controller.rb

INSERT INTO "events" ("booking_id", "created_at", "end_at", "name", "start_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["booking_id", 4], ["created_at", Tue, 07 Aug 2012 09:40:15 UTC +00:00], ["end_at", nil], ["name", "Test"], ["start_at", nil], ["updated_at", Tue, 07 Aug 2012 09:40:15 UTC +00:00]]
---
  def create
    @booking = @bnb.bookings.new(params[:booking])
    @booking.event.name = @booking.guest_name
    @booking.user_id = current_user.id
    if current_user.role.description == "Owner"
      @booking.status = :booked
    end

    respond_to do |format|
      if @booking.save