app/controllers/events_controller.rb

  def show
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("booking_id", "created_at", "end_at", "name", "start_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "events" SET "name" = '', "start_at" = '2012-08-08 13:05:00.000000', "end_at" = '2012-08-11 13:05:00.000000', "updated_at" = '2012-08-08 13:05:52.001279' WHERE "events"."id" = 7

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]