app/controllers/photos_controller.rb

INSERT INTO "photos" ("bnb_id", "created_at", "description", "image", "order", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["bnb_id", 59], ["created_at", Sat, 28 Jul 2012 15:22:27 UTC +00:00], ["description", "Piggy"], ["image", "test.jpg"], ["order", 1], ["updated_at", Sat, 28 Jul 2012 15:22:27 UTC +00:00]]
---
  def create
    @photo.image.success_action_redirect = process_image_bnb_photo_url(@bnb, @photo) if @photo.save

DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 2]]
---
  def destroy
    @photo.destroy

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def load_resource
    Photo.unscoped { @photo = @bnb.photos.find(params[:id]) }

SELECT "bnbs".* FROM "bnbs" ORDER BY "bnbs"."id" DESC LIMIT 1
---
  def load_resources
    @photos = @bnb.photos.includes(:bnb).scoped