app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."bnb_id" = 66
---
  def index
    @rooms = Room.search(params[:search]).where('bnb_id = ?', @bnb.id).order(sort_column + " " + sort_direction).paginate(:per_page => 15, :page => params[:page])

INSERT INTO "rooms" ("available", "bnb_id", "capacity", "created_at", "description", "en_suite", "extras", "rates", "room_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @room = @bnb.rooms.new(params[:room])
    populate_default_room
    respond_to do |format|
      if @room.save

UPDATE "rooms" SET "description" = 'Honeymoon suite', "updated_at" = '2012-08-01 16:02:59.972821' WHERE "rooms"."id" = 1
---
  def update
    respond_to do |format|
      if @room.update_attributes(params[:room])

DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 61]]
---
  def destroy
    @room.destroy

SELECT "bnbs".* FROM "bnbs" ORDER BY "bnbs"."id" DESC LIMIT 1
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "61"]]
---
  def find_available
    @booked_rooms = Room.booked(Date.parse(params[:start_date]),Date.parse(params[:end_date])).where(:bnb_id => @bnb.id)
    @rooms = Room.find_all_by_bnb_id(@bnb)
    @booked_rooms.nil? ? @unbooked = @rooms : @unbooked = @rooms.to_a - @booked_rooms.to_a