app/controllers/static_pages_controller.rb

  def home
    @bnb = Bnb.find_by_user_id(current_user)
---
SELECT "bnbs".* FROM "bnbs" WHERE "bnbs"."user_id" IS NULL LIMIT 1