app/controllers/suggestions_controller.rb

  def create
    @suggestion = Suggestion.new(params[:suggestion])
    flash[:notice] = 'Thank you for your feedback. ' if @suggestion.save
---
INSERT INTO "suggestions" ("created_at", "subject", "suggestion", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 08 May 2013 10:42:00 UTC +00:00], ["subject", nil], ["suggestion", nil], ["updated_at", Wed, 08 May 2013 10:42:00 UTC +00:00], ["user_id", nil]]